// OOП

// Объектно-ориентированное программирование
// Процедурное программирование - набор не связанных явно функций и
// переменных для хранения и обработки информации.Этот подход прост и
// прямолинеен и подходит для задач где нет тесно связанных
// сущностей(данных и функций для их обработки).

// procedural code
// Рассмотрим пример процедурного кода где есть переменные и функция д
// ля подсчета результата.

// const baseSalary = 30000;
// const overtime = 10;
// const rate = 20;

// const getWage = (baseSalary, overtime, rate) => {
//   return baseSalary + overtime * rate;
// };

// getWage(baseSalary, overtime, rate);

// ======================================================================

// Объектно - ориентированное программирование(ООП) - методология, основанная
// на представлении программы в виде совокупности объектов, каждый из
// которых содержит данные(свойства) и методы для взаимодействия с ними.

// object-oriented code
// Используем ООП, собрав данные в объект employee.

// const employee = {
//     baseSalary: 3000,
//     overtime: 10,
//     rate: 20,
//     getWage() {
//         return this.baseSalary + this.overtime * this.rate;
//     },
// };

// employee.getWage();



